broadleaf-framework/overhead_evaluation/ab_normal.log
============================= SUMMARY =============================
Connection Times (ms)
              min  mean[+/-sd] median   max
Round 1:       90  142  33.9    133     228
Round 2:       67   94  14.6     91     150
Round 3:       68   83   7.8     83     113
Round 4:       63   77   7.4     76      96
Round 5:       62   76   8.4     75     119
AVERAGE:       70 94.4  14.4   91.6   141.2

============================= DETAILS =============================

This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        34183 bytes

Concurrency Level:      1
Time taken for tests:   10.072 seconds
Complete requests:      71
Failed requests:        0
Total transferred:      2453334 bytes
HTML transferred:       2426993 bytes
Requests per second:    7.05 [#/sec] (mean)
Time per request:       141.854 [ms] (mean)
Time per request:       141.854 [ms] (mean, across all concurrent requests)
Transfer rate:          237.88 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    90  142  33.9    133     228
Waiting:       43   69  19.9     64     129
Total:         90  142  33.9    133     228

Percentage of the requests served within a certain time (ms)
  50%    133
  66%    154
  75%    163
  80%    168
  90%    188
  95%    218
  98%    227
  99%    228
 100%    228 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        34183 bytes

Concurrency Level:      1
Time taken for tests:   9.415 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      3455400 bytes
HTML transferred:       3418300 bytes
Requests per second:    10.62 [#/sec] (mean)
Time per request:       94.153 [ms] (mean)
Time per request:       94.153 [ms] (mean, across all concurrent requests)
Transfer rate:          358.40 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    67   94  14.6     91     150
Waiting:       32   45   7.7     43      73
Total:         67   94  14.6     91     150

Percentage of the requests served within a certain time (ms)
  50%     91
  66%     96
  75%    102
  80%    104
  90%    116
  95%    119
  98%    145
  99%    150
 100%    150 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        34183 bytes

Concurrency Level:      1
Time taken for tests:   8.297 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      3455400 bytes
HTML transferred:       3418300 bytes
Requests per second:    12.05 [#/sec] (mean)
Time per request:       82.970 [ms] (mean)
Time per request:       82.970 [ms] (mean, across all concurrent requests)
Transfer rate:          406.70 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    68   83   7.8     83     113
Waiting:       32   40   5.1     39      62
Total:         68   83   7.8     83     113

Percentage of the requests served within a certain time (ms)
  50%     83
  66%     86
  75%     87
  80%     88
  90%     93
  95%     96
  98%    103
  99%    113
 100%    113 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        34183 bytes

Concurrency Level:      1
Time taken for tests:   7.735 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      3455400 bytes
HTML transferred:       3418300 bytes
Requests per second:    12.93 [#/sec] (mean)
Time per request:       77.345 [ms] (mean)
Time per request:       77.345 [ms] (mean, across all concurrent requests)
Transfer rate:          436.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    63   77   7.4     76      96
Waiting:       29   36   4.0     36      49
Total:         63   77   7.4     76      96

Percentage of the requests served within a certain time (ms)
  50%     76
  66%     81
  75%     83
  80%     83
  90%     87
  95%     91
  98%     95
  99%     96
 100%     96 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        34183 bytes

Concurrency Level:      1
Time taken for tests:   7.640 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      3455400 bytes
HTML transferred:       3418300 bytes
Requests per second:    13.09 [#/sec] (mean)
Time per request:       76.401 [ms] (mean)
Time per request:       76.401 [ms] (mean, across all concurrent requests)
Transfer rate:          441.67 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    62   76   8.4     75     118
Waiting:       28   35   5.0     35      69
Total:         62   76   8.4     75     119

Percentage of the requests served within a certain time (ms)
  50%     75
  66%     80
  75%     82
  80%     83
  90%     87
  95%     89
  98%     94
  99%    119
 100%    119 (longest request)